[
    {
        "author": "Diligent_Parfait_984",
        "body": "his strategy doesn;t work, automated it.",
        "created_utc": 1719168938.0
    },
    {
        "author": "DaCriLLSwE",
        "body": "It’s not the strategys that’s unprofitable, it’s you. \n\nNo one is profitable at first, regardless of strategy.\n\nImagine if it was only finding the rigth strategy to become profitable. Imagine a digital money printing machine. You really think that could be kept a secret for long?\n\nYou need to stick to one strategy, and get hours and hours infront of the charts.\n\nYou need to journal and you need to be able to see the difference between when the market was to blame and when you made a misstake.\n\nWith time you adapt you strategy in different ways. The strategy you end up with migth not even be anything like what you started with. \n\nYou need time, and experience.\n\nTrading is not about finding the holy grail, it’s about making your own, with repetition and self analysis.\n\nImagine the beginning of trading, no one knew sh*t. But people sat infront of the charts and stared at price action long enough to discover patterns of event that repeated and often produced the same results.\n\nI’m not saying go in blind, but read up on some price action and start grinding out those reps.",
        "created_utc": 1719163619.0
    },
    {
        "author": "Total-Crew-8727",
        "body": "If i was beginning again id definitely find a mentor right from the bat i find theres too much confusion trying to piece together things bit by bit and mixing yourself up focus on one strategy and technique and master that. psychology and finding the most simple approach to the markets that fits you is key but this is opinion based we are all different i wish you the best of luck on your journey",
        "created_utc": 1719163388.0
    },
    {
        "author": "Total-Crew-8727",
        "body": "I think we will see a bit of relief on bearish momentum going into tomorrow and early Tuesday to eventually continue downwards in the later side of the week i really see the yearly lows on the cards the daily has left a lot of liquidity behind for last week so plenty of room to takeout but all in all i would be following trend and looking for shorts not enough room upwards for me and my strategy too considering longs but again it all depends on how you trade and what your happy with rr wise",
        "created_utc": 1719163079.0
    },
    {
        "author": "AceMcNasty",
        "body": "Depends on the complexity of the strategy and things like what’s the likelihood of hitting both TP and SL intrabar; or are you going to enter on say 1H and then go down to 1M so you’ll know which is hit first?\n\nYour results would be very accurate if it was “go long 100 pip tp and sl, using 1M”, but it would very inaccurate if it was “go long with 0.2x Atr tp and a 22pip sl using a weekly chart”.\n\nGenerally speaking my mean reversion strategies are extremely accurate when back tested, but the trend strategies can be wildly different. The latter having more calculations and variables.\n\nUsing a non-standard chart can also skew your results, ex using a 3 line break chart (this is a chart type, not ma cross or whatever people are going to reply with as minds get blown anytime I mention line break) is only accurate if you enter/exit when a new bar is drawn, you won’t be using typical tp and sl values. Plus you have to set it to 1 bar then you can trade a 3 bar with overlay as testing 3 bar directly is WIlDLY inaccurate.",
        "created_utc": 1719161732.0
    },
    {
        "author": "Aromatic_Leader9087",
        "body": "I never understood why people gatekeep their strategy if it works so well why not want to see everyone win?",
        "created_utc": 1719161331.0
    },
    {
        "author": "InstantGain",
        "body": "I think the only way to really know is to backtest your strategy on multiple pairs and trade the ones where it works. No need to trade a pair or asset where your strategy fails. No reward without the work. Good luck.",
        "created_utc": 1719158026.0
    },
    {
        "author": "Strange-Chance-8195",
        "body": "Support and Resistance with risk management has a high profit factor. What do you mean? Even if you are 30% correct you would still come out on top. What is your strategy?",
        "created_utc": 1719153594.0
    },
    {
        "author": "AfternoonLogical6796",
        "body": "I didn't want to be forced to watch news. So I prefer swing. My strategy is pattern recognition and moving averages. Once the pattern looks right I enter.",
        "created_utc": 1719150337.0
    },
    {
        "author": "Global-Ad-6193",
        "body": "Lovely work well done! I had a bad week on gold but it's doing good for me on the whole this month.\n\nWhat's your strategy?",
        "created_utc": 1719147967.0
    },
    {
        "author": "Global-Ad-6193",
        "body": "Good work what's your strategy? Why swing account do you trade news or have the positions over night? As you smashed them both in four trading days which you could have done cheaper on their normal 100k account.",
        "created_utc": 1719147463.0
    },
    {
        "author": "No-Row-9782",
        "body": "Mind sharing your gold strategy? :D",
        "created_utc": 1719146931.0
    },
    {
        "author": "Few_Calligrapher_959",
        "body": "it doesn’t, price is algorithmic. Just think about what you said and if it makes sense. “You can backtest everyday and it still won’t make you better on live market time”, that backtest was once live market. It doesn’t “work for me” it’s the fact you need to test your strategy over a large sample size in order to be sure it works and is profitable in different market conditions, once again im trying to help you but you either don’t care or think you know better",
        "created_utc": 1719144126.0
    },
    {
        "author": "gohditto99",
        "body": "Have you tried backtesting your strategy",
        "created_utc": 1719142282.0
    },
    {
        "author": "kubo_czdzb",
        "body": "I love how people drown in emtional pain cause they “should/could” … even if u catch, u will not hold it that long.. and when u will have enough balls to hold, it will bounce back to be or loss .. u need to have plan/strategy.. if ur strategy is catching 5 dollars… u dont care about 60$ moves or anything else.. if u there for 30+ moves.. u will probably more loose than win, since it will bounce back, u will sell be and it will reverse.. \n\nHave a green ones only",
        "created_utc": 1719141813.0
    },
    {
        "author": "Shwambla21",
        "body": "Don't give up now I understand your struggle. Now randomly choose one strategy from the once you learnt, stick to it solely. Backtest, have a reason for every trade you make. Pick on one pair and session focus on that for one week of intense backtesting you must see results. I am poor at writing I prefer calls but I believe the little I have shared will help you.",
        "created_utc": 1719141539.0
    },
    {
        "author": "vlsunga",
        "body": "If you're day trading and not swing trading, one highly liquid pair is more than enough in my opinion. I only trade XAU/USD with a strategy that's tailored to how it repeatedly moves and my results are better than back when I was watching multiple pairs. Some advice I picked up a while back was to \"do less but do it bigger and better\" and it's certainly worked for me.",
        "created_utc": 1719141514.0
    },
    {
        "author": "Fiskmospotatis",
        "body": "I was profitable for 4 months on demo just bc i had good No risk management, had No specific strategy or nothing, then it flipped the other way and now i can only get to break even never actually profit, 1 month of demo testing is NOTHING people spend years unprofitable and if u think ur gonna make money and become a millionaire after a month then ur either delusional or disrespecting the art of trading G. Gl on ur Journey tho, wish u the best if u actually stick wid it",
        "created_utc": 1719139128.0
    },
    {
        "author": "No_Violinist5663",
        "body": "You're asking the real question here mate!\n\nIf you have a proper risk management and trading strategy then you know how much trading position you can open with your balance without considering the leverage! In this case, all leverage does is reduce the margin required to open a trade! Then you have more capital to support your trade. Of course, you should calculate your stop-loss and have it at a reasonable price! Just because you have more capital to support your trade, doesn't mean you should give it all to support your trades! In that case, again you are not using leverage properly and basically is not different than going full margin or over-trading.",
        "created_utc": 1719133458.0
    },
    {
        "author": "marciomavungo",
        "body": "You can’t, the best thing you could do is to follow it, off course according to your strategy.",
        "created_utc": 1719133211.0
    },
    {
        "author": "gohditto99",
        "body": "Backtest your strategy with diff pairs to see which work best",
        "created_utc": 1719132835.0
    },
    {
        "author": "Equivalent_Emu_5304",
        "body": "I have been trying to find a profitable strategy for four years, I have even developed some EAs using python, mt5,  and tradingview strategies to avoid psychological issues and get proper risk management .  Started from the basics ema crossovers to the most complicated smc ones. I have mt5 EAs published, with hundreds of downloads (for free). I am at the point that I think that this is all aleatory. Is purely gambling. May be that under some circumstances the win ratio exceeds the 50% and understanding those circumstances is what we call a strategy. That been said,  I quite forex and will try options market.",
        "created_utc": 1719131894.0
    },
    {
        "author": "Filipuss",
        "body": "Hey brother, I am exactly like you, I understand you perfectly and for now I’am struggling like you. What I can say is to build your own system, I think this is the secret, because you can’t think like other to understand their strategy 100%. Honestly I’ve learned everything, every concept, from ICT/SMC to orderflow to indicators everything and for now I’m not profitable yet and I’m building my own system with all what I’ve learned. I hope you be better and never give up on this, how other can do, you can do either. Good luck, brother!",
        "created_utc": 1719130581.0
    },
    {
        "author": "maciek024",
        "body": "Almost no strategy works",
        "created_utc": 1719128180.0
    },
    {
        "author": "zorny85",
        "body": "True. Cause if all the loser traders on YouTube would use a working strategy, then all the banks, who are actually moving the market, would change their strategies as well, right? Cause they go to YouTube and learn all of their trading skills, right?",
        "created_utc": 1719127884.0
    },
    {
        "author": "sinnombre74",
        "body": "whats your strategy bossman?",
        "created_utc": 1719127645.0
    },
    {
        "author": "sinnombre74",
        "body": "whats your strategy brodie?",
        "created_utc": 1719127621.0
    },
    {
        "author": "Forex_Jeanyus",
        "body": "I wouldn’t say I have a strong background in Silver Bullet per se, but I think you are targeting the high/lows of the Asian session.  So if the low is swept, then you would enter when all the other confluences line up and set your TP for the Asian session high. \nI traded it on GBP/USD for about 2 months and I would get maybe 3 trades a week and saw some pretty massive RR wins in there. I think it’s good for ppl who just want to trade one strategy or work full time jobs. For me, I enjoy scalping/intraday trading so I could see doing that as a supplementary activity. \n\nI think I’ll open another small account and use that for only Judas Swing / Silver Bullet trading.",
        "created_utc": 1719125908.0
    },
    {
        "author": "AceMcNasty",
        "body": "How in the world did you get the data to determine that limit orders are more popular than market orders?\n\nI understand limit orders are ineffective to you, which is why I said: \"a stop order would be useful if someone is trying to trade with the trend and a limit order would be useful if someone is doing mean reversion OR trying to enter on a pullback of a trend.\" & \"From the looks of it you're trying to trade the trend, so you'd typically be using a stop order. You had 1 loss, 2 dodges, and 1 win. But if you used limit orders you would have 2 wins, but this is also hindsight. The more likely scenario would be you not getting the red entries; you'd either not get hit or the position would be off.\"\n\nTLDR; I explained why you'd want to use stop orders. Your trend following strategy is not suited for limit orders, though depending on the exact entry point it could work for you. You'd need to test it out in order to figure it out for certain.",
        "created_utc": 1719125725.0
    },
    {
        "author": "Cautious-Ad7723",
        "body": "The best strategy I can give you is to stop trading and start a business",
        "created_utc": 1719125221.0
    },
    {
        "author": "tlambo86",
        "body": "YouTube: JeaFX (He has great knowledge on the markets) easy to follow.\n\nEvery strategy works. Not all strategies work on all pairs and not all will work in all market conditions.\n\nYou're the problem. You need to find a YouTuber or a strategy you feel comfortable with and make changes based on your personality as a trader.\n\nThen stick to it no matter what.\n\nYou're like the guy that says going to the gym isn't working for him because \"you've always been skinny\". But you don't go consistently and every time you do go, you work on something for a month or 2 and decide it isn't working. Or the food/sleep patterns are a mess.\n\nLastly you have NOT worked on your psychology or you wouldn't be here begging for help. Stop trying to make money and start trying to place good trades in the market. Eventually the money comes.\n\nNot everyone is supposed to make it in Forex otherwise we'd all be rich.",
        "created_utc": 1719123112.0
    },
    {
        "author": "mr_holgrave",
        "body": "Keep struggling, my man. I think every successful trader has gone through the same journey at some point. It's not easy and the school fees are expensive. \n\nMy strategy essentially involves looking at higher time frames for directional bias and price levels that form structures / significant levels. Then, observe how the lower time frames react to those levels / ranges of price. \n\nI would also recommend getting a solid risk management strategy in place. I never risk more than 1% on a single position and have a maximum number of positions I'm willing to take in a single day.\n\nYour job as a trader is to minimize as many risk factors as possible before entering a position and by finding as much confluence across the chart time frames as you can.\n\nStop looking for a strategy you can copy, go learn different concepts, and apply them until something sticks. Lastly, wanting a specific RR and win rate is going to keep you stuck where you are. Focus on concepts and learning how the market moves.\n\n\nGood luck!",
        "created_utc": 1719122780.0
    },
    {
        "author": "AceMcNasty",
        "body": "I don't even know why y'all buy his BS in the first place (well, I do know, he's one hell of a good marketer). But seriously, liquidity? With FX, especially majors, there isn't a liquidity gap. He's talking about stuff that happens with things like low volume options trading, not FX. FX the market makers ensure liquidity which is why your orders basically always get filled at the point you want.\n\nUntaken liquidity is something like me wanting, I don't know, PEGY calls for June 28. On June 27 I want to sell my option for $20 but there's only buyers at $1 and below. Now I can either hold (and probably lose my premium) or I can take the $1 which would be a liquidity gap since no one was willing to do a deal at the prices between. That sort of stuff doesn't happen with retail FX. You'll be filled basically anytime, any price. There is no untaken liquidity.\n\n>is my understanding of the silver bullet strategy correct?\n\nYou might understand the strategy correct, but the guy telling it to you has one goal. Make money for himself. Wanna know where his money comes from? YouTube ads. So, he got to keep you watching. He is actually NOT incentivized to teach you; he benefits far more if you don't learn a thing and keep watching his videos. That's why he makes everything super complicated, and then you can never blame him as he always has a way out. Oh, you missed the FVG? Ah that's because of untaken liquidity and there wasn't a bump, rocket, bump, or whatever the f\\* he calls it.\n\n>if not, what liquidity should we hunt for (previous hour, session, or day )?\n\nNone, because you're literally hunting for Big Foot at this point.",
        "created_utc": 1719116467.0
    },
    {
        "author": "rdood2",
        "body": "Look, well in that case for myself personally, I trade DTFX, his course is free on youtube and there's plenty of other traders which post about his strategy like stoic trader, PacTrades, strangerFX. \n\nWith DTFX, you can have 100% win rate most days, but you can have all the knowledge in the world about DTFX but you need to have mastered your own psychology first.",
        "created_utc": 1719114610.0
    },
    {
        "author": "Disastrous_Test7867",
        "body": "The best strategy is to quit this gamble",
        "created_utc": 1719104654.0
    },
    {
        "author": "Few_Calligrapher_959",
        "body": "don’t use the silver bullet strategy, after backtesting it on a larger sample size it’s not profitable, learn real concepts and how to read the markets",
        "created_utc": 1719103477.0
    },
    {
        "author": "Winter420af",
        "body": "So u have different strategies and u haven't stuck with one yet. Do u even realize that u are giving us the problem and the solution??? Honestly i am a little upset after reading what u have done for the past 3 years and finally u end up here...my advice is to work on your psychology cus no trading strategy will make consistent money and also how tf u haven't made your OWN STRATEGY AFTER 3 FCKING YEARS???? Honestly speaking....You also lack discipline and consistency because if u stay on one strategy (your own), spend months improving it and back testing, u would've become a profitable trader a long time ago.",
        "created_utc": 1719102252.0
    },
    {
        "author": "Forex_Jeanyus",
        "body": "Most strategies actually do work. But the best strategy is one that you build yourself - it’s best to take bits and pieces of multiple concepts / strategies and find an entry/exit rule that suits your style and psychology. \n\nKeep following YouTube traders - there is tons of valuable information there. But don’t try to emulate anyone in particular - just focus on developing your own style.  Find one, maybe two markets only and then just watch them until your eyes glaze over. Eventually, you will start to see the market differently. Even though it’s unpredictable you will still be able to “see” what is doing or likely to do in the future.",
        "created_utc": 1719099657.0
    },
    {
        "author": "Chochi716",
        "body": "you don't find a profitable strategy. you create one.",
        "created_utc": 1719099483.0
    },
    {
        "author": "luvsemih",
        "body": "It would work. Would it work every time? No. Because some days there are multiple macroeconomic data released at once which can have different outcomes. Meaning i.e. data A is positive while data B is negative. The market would spike in both directions and settle down in one direction in the end. Other days, the data of the news release might be equal to the forecast. Thus there might be a similar scenario as earlier mentioned. You must realize that big hedge funds trade news with their high frequency algorithms. These algorithms analyze and execute their orders before you can actually read the news outcome. If you’ve done enough research I feel like you can trade certain news. However be aware that slippage and really high risk come into play. Therefore this isn’t an attractive strategy for a retail trader.",
        "created_utc": 1719099292.0
    },
    {
        "author": "fluxusjpy",
        "body": "Correct. Anything can work. Any strategy can work, it's up the trader.",
        "created_utc": 1719099261.0
    },
    {
        "author": "Blaiddyn",
        "body": "You can get mentored by the best trader in the world or take a million different courses but if YOU don't put in the work required to become profitable you will never become profitable. It's not about \"finding a strategy that's profitable\" it's about picking a strategy that makes sense to you that resonates with you, sticking to it and troubleshooting it if it doesn't work. If you are not willing to troubleshoot your strategy then you will never be profitable. \n\nYou have to know your numbers in order to figure out what you need to troubleshoot so figure out what your numbers are first and then go from there. That is my advice to you.",
        "created_utc": 1719098301.0
    },
    {
        "author": "sanarilian",
        "body": "I normally don't bother to respond. Your post sounds sincere and resonates with my beliefs. I can't tell you exactly my strategy, but I will share my journey and how I arrived at my mechanical strategy. \nFirst of all, I just have to vent that a lot of the comments here criticize you for not trying hard enough on this and that, psychology is wrong, blah, blah. They don't know you, how dare they blame you for anything.\nI started with manual trading and ended up as an algorithmic trader. I automated and tested literally 120+ strategies including news utilizing strategies over 18 years of data. My conclusion is that the forex market is very noisy. There are a lot of randomness in the price movements, at all practical time scales, which don't really correlate to anything else. All the pattern based entry and exit strategies don't really work. They may be profitable for a period of time out of luck. It has nothing to do with psychology because my test programs don't have emotions. None of the price actions or indicators has predictive power in short term. I am quoting out of my experience, not from any book. This is the reason that many algo traders avoid forex.\nI am not saying there are no profitable manual traders. I can't prove it either way. Who am I to condemn everyone. I am just saying I gave up on manual, technical or fundamental trading, and highly skeptical if anyone can.\nAlgo trading is the way for me. The approach has to be statistical meaning you can't say which trade will win, but you can say what percentage of your trade will win. Because I found the market statistics don't change too much in a year to year basis. So, learn programming, statistics, probability and make an algo trading machine for yourself.",
        "created_utc": 1719097877.0
    },
    {
        "author": "False_Bookkeeper_884",
        "body": "I know that! No strategy works 100 percent of the time !",
        "created_utc": 1719095281.0
    },
    {
        "author": "Philly_DFA",
        "body": "I didn't read all that. There are like 30 different strategies. Some are even strategies put together and called another strategy. Learn them all and see what works best for you. No single strategy works 100%. Learning them all, at least the basics will help you understand what's going on before you keep losing money. I don't care what any one says technical analysis is fake and bullshit. Your method can get you wins but there's folks out here winning trading on astrology. Just find what works for you even if it's based on Mcdonalds staffing schedule next week. If it works for you it works.",
        "created_utc": 1719095025.0
    },
    {
        "author": "Blaiddyn",
        "body": "I had this realization a couple years ago while I was strategy hopping. OP needs to figure out what strategy resonates with him the most and hone in on it. If he sucks at executing the strategy and strategically setting stop losses, OP needs to figure out what he is doing wrong and correct it. This takes practice and it takes hard work. It's like playing guitar, 99.9999% of the population are not prodigy guitar players. Some of the best guitar players sucked when they first started and they had to spend hours upon hours practicing.",
        "created_utc": 1719094862.0
    },
    {
        "author": "False_Bookkeeper_884",
        "body": "Yes I know ! My dream is to have a 50 percent win ratio with a 2:1 risk reward ratio ! It could be awesome to find such a strategy! If you know one, share it !",
        "created_utc": 1719094489.0
    },
    {
        "author": "SevereParamedic4985",
        "body": "Other than the fact that it decided to retrace to the level of the previous day, I didn’t really see any clear indications of such a big sell off. Even if I’d wanted to get in to a sell I didn’t see any clear entries. My strategy was looking for buys so needless to say I lost on Friday. Next week is a new week and live to fight another day",
        "created_utc": 1719094453.0
    },
    {
        "author": "ThePonderer84",
        "body": "Here's the hard truth. The issue has nothing to do with the strategy. You're the issue. You're what you need to work on. Stop changing strategies. Pick one, identify where you're going wrong and think about how you could be responsible for that issue.",
        "created_utc": 1719094379.0
    },
    {
        "author": "Blaiddyn",
        "body": "You're troubleshooting the wrong issue. You should be troubleshooting your risk management and maybe the effectiveness of the execution of your strategy. \n\nYou could have a strategy that says if I flip a coin and get heads I'll go long and if I get tails I'll go short. If you implemented that strategy you'd be right 50% of the time over a long period of time. Where risk management comes in is calculating your position size correctly and having a favorable risk to reward ratio. If you have a 50% win rate that is correlated to a 2:1 risk reward ratio, for example, you'd be a profitable trader assuming you are calculating your position size correctly and you are effective at executing your strategy.\n\nYou can't out trade bad risk management.",
        "created_utc": 1719094282.0
    },
    {
        "author": "maciek024",
        "body": "> that if the majority of traders lose money is not always their fault: it's because they can't find a decent and profitable strategy\n\nwell, it is their fault that they cant find it, no one else will do it for you\n\n>I don't want a strategy that has a risk reward ratio below 1:1 for psychological reasons and I dislike reversal strategies too\n\nand thats why it is your fault, market does nott give a fuck about what you like or what you dont, you play what works\n\nthere is a reason why there are almost no good strategies on yt ect, people who have an edge that is not discretional dont share it, if they did, it would vanish",
        "created_utc": 1719094201.0
    },
    {
        "author": "False_Bookkeeper_884",
        "body": "Many different types of strategy! I would have stuck with one if it was profitable. I would not have asked this question too. From support resistance, supply demand and breakout . I Have also tested many free different strategies on tradingview and nothing works! I don't know if people teach horribly, but the majority of people teach the same garbage! 😔 I feel however that I can find something one day . I am not alone in struggling a lot too !",
        "created_utc": 1719093994.0
    },
    {
        "author": "EsTrader007",
        "body": "What strategy you been using?",
        "created_utc": 1719093657.0
    },
    {
        "author": "Queasy_Bee_4911",
        "body": "Just find a simple strategy. For example on US100 you could wait for the previous daily candle to get sweet whether that’s high / low and then enter off a BOS on the 1m that leaves a gap. Simple. Don’t change. Don’t try shrink your SL and you’re calm",
        "created_utc": 1719086644.0
    },
    {
        "author": "Sebb99",
        "body": "It's not that difficult actually, I get along well with my strategy that I've been using for a while and honestly I wouldn't succeed with higher timeframes, ok that at m1 the price action is confusing but the market is fractal, it's not much different from an execution at m5/15",
        "created_utc": 1719074550.0
    },
    {
        "author": "DaCriLLSwE",
        "body": "bro……\n\nYou wont be proftibale no matter what strategy you choose in the beginning. You need time infront of the charts and experience.\n\nIf it was only about finding the rigth strategy we’d have billionar traders all over the place",
        "created_utc": 1719073519.0
    },
    {
        "author": "Forex_Jeanyus",
        "body": "Supply and demand within itself isn’t really a strategy. Just a concept that can form part of a strategy once you understand it. A strategy involves knowing the overall market behavior and what it’s doing right then and now, applying principles like S&D, S&R, FVG’s, order blocks, volume, Level 2, etc and then having certain rules for entry and exiting. How much to risk.",
        "created_utc": 1719070706.0
    },
    {
        "author": "SomethingAgainstD0gs",
        "body": "Becoming break even, or hell, even losing at a slow rate is a massive win and the first step to profitablity. Obviously, don't jump strategies too often but you still have to use both back and forward testing to see the tiny tweaks you need to change. Think of it like using the scientific method and having very micro, marginal changes over time.\n\nAnd example for me was: I had gotten out of a massive losing streak with the strategy I currently use (which losing streaks are normal and don't mean anything is wrong). However, my profits were still coming in very very slowly. I had been using a 1:1 rr. My win rate was 50%. But i saw that during my wins, the charts would often go pass my tp. Hypothesis: raising my rr from 1:1 to 1:1.5 would decrease my win rate but make my profits bigger. I forward tested it on a fake account for a while and my win rate dropped to around 35-40ish%. Then over time, I noticed it would still blow pass my tp, wash, rinse, and repeat.\n\nI did that with other things about my strategy as well but long story short, be a scientist.",
        "created_utc": 1719068676.0
    },
    {
        "author": "EthanIsBlessed",
        "body": "So at the start of the week, I analyse the daily, just to get my bias for the trading week. I normally analyse the 1hr for my target zones, then 15m for my entry zones, then 1m for confirmation. \n\nBe advised that this is for my strategy, and you should not copy this if it doesn’t align with your strategy.",
        "created_utc": 1719068103.0
    },
    {
        "author": "Material_Block3491",
        "body": "Lol, I am also 1 week in 😂. I prefer mq4 and meta trader. The strategy is important also not only knowing how to code bots.",
        "created_utc": 1719065983.0
    },
    {
        "author": "sinnombre74",
        "body": "whats your strategy?",
        "created_utc": 1719065212.0
    },
    {
        "author": "PhantomKreatures",
        "body": "I ve never backtested it and i was not consistent with the rules of my strategy thats why i didnt change it but now im more free and im disciplined and dont get into trades without all of my confluences being present so i will backtest it for a month if its not gonna work then im going to change my strategy obviously",
        "created_utc": 1719064043.0
    },
    {
        "author": "craigstone_",
        "body": "\"I'm not profitable after 15 months\"\n\"I haven't changed my strategy\"\nChange your strategy. You've got to be prepared to take backwards steps if the ground you're standing on isn't working. Otherwise, you're just gonna walk further in the wrong direction.",
        "created_utc": 1719063176.0
    },
    {
        "author": "winternsummer",
        "body": "It sounds like you're really committed to trading, which is a great start. Here are a couple of pieces of advice that might help you along the way:  \nProtect your capital like it's your best friend. Set clear stop-loss orders for every trade and stick to them—no matter what the market whispers. It's the shield that keeps your dreams alive in the trading arena.  \nStay ahead of the curve: Learn, adapt, thrive. Analyze every trade—wins and losses—to refine your strategy. Stay tuned to market shifts and trends. Connect with fellow traders in communities; ideas ignite progress.",
        "created_utc": 1719062417.0
    },
    {
        "author": "benchmarkakurdi",
        "body": "After trading for 10-15 months i thought I was lacking psychology and not able to control emotions or the classic like it takes 3 -5 years to become successful and bla bla. \nThe problem was with my strategy. I thought price action trading was enough. Everyone was talking about SMC and ict. I am giving it a try and man i was so wrong and wrong for such a long time. I should have started understanding liquidity sooner. \n\nThis is just my experience.",
        "created_utc": 1719061359.0
    },
    {
        "author": "Relevant_Ad5790",
        "body": "May I know what is your trading strategy and also your lot size when you do trade ?",
        "created_utc": 1719060126.0
    },
    {
        "author": "Imooku",
        "body": "I am gonna yoink that one comment from the other post that I think is suited for this post.\n\n“It is the trade secret like every other businesses”. Which means that you have to find and craft your own unique edge.\n\nYou mentioned that you daytrading, use basic SnR strategy, journaling every trades and use fixed % risk per trade with fixed number of trades per day, no strat hopping, all of which is very good. I will assume that you experience the slowly account bleed and/or reaching breakeven trading phases (which is also very good, break even phase is one of the hardest/longest phase to stay in, in my experience).\n\nRight now you will need some more factors to reach profitability, one is more backtesting, two is use your backtesting data to adjust/further tuning your strategy, three is when you done before steps you will need to mental check where your now updated-strategy aligns with your liking, your attention span and your risk tolerance. \n\nThen you get to the printing money phase.\n\nI believe to reach this profitable phase a trader must have skillset where almost all factors at good/high level. If one of them is missing or weak, it will drag performance down to breakeven phase.\n\nEdit: sorry you already said you are breakeven but I accidentally skip that last words, I should not assume any experience that you are in, my bad.",
        "created_utc": 1719058496.0
    },
    {
        "author": "fx_ameliee",
        "body": "Well it depends on how are you Trading, which strategy you are using and most important part  YOUR RISK AND LOSS FACTOR , AND  how do you manage them , as they are the most important other than timing of your trades and how many trades do you take in limited amount of time",
        "created_utc": 1719058342.0
    },
    {
        "author": "DaCriLLSwE",
        "body": "Dont bro.\n\nLearning technical analysis and strategys is pretty straigth forward.\n\nIt’s the experience that take time and no mentor och gura can really help that. You need YOU to be infornt of the charts, A LOT.\n\nThousands of hours.\n\nRemember, at one point no one knew sh*t about trading but some dudes sat there and just watched price moves and started picking up reacuring pattern of events.",
        "created_utc": 1719048671.0
    },
    {
        "author": "Nomadwarrior123",
        "body": "Go check Bernd Skorupinski  youtube channel, watch some of his videos about his strategy, it works because i used it, he has been calling out trades and making docuseries about passing prop challenges live ( 6M$ in total i believe now with swing trading), no need to pay some fake trading guru a course that won't help you anyway\n\nFind someone who is a professionnal trader with 10 years of experience or more, if you choose him as a mentor, you will be paying for his time  not his course",
        "created_utc": 1719042843.0
    },
    {
        "author": "Slow_Fox967",
        "body": "Aaahhh yes!!!! The old spray and pray strategy. Many have tried, even more have failed.\n\n The retardation is strong with this one. May the gains be forever stay out of your reach,, young blood.",
        "created_utc": 1719041205.0
    },
    {
        "author": "Material_Block3491",
        "body": "I can't trade because of a lack of discipline. It is not only about the knowledge this is why I made a bot for my strategy and everything is smooth now..",
        "created_utc": 1719039908.0
    }
]